module attributes {torch.debug_module_name = "Linear"} {
  func.func @forward(%arg0: tensor<1x3x200xf32>) -> tensor<1x3x200xf32> {
    %cst = arith.constant dense<[1, 200, 200]> : tensor<3xi64>
    %0 = stablehlo.constant 